import pyautogui as pg
import time
import numpy as np
from mss import mss

# нажатие на иконку браузера
pg.click(369, 1059)
# нажатие на вкладку
pg.click(45, 15)
# нажатие на кнопку КУПИТЬ
pg.click(899, 464)
# нажатие на кнопку ОПЛАТИТЬ
pg.click(915, 608)
pg.click(915, 608)
pg.click(915, 608)

# нажатие на иконку браузера
pg.click(417, 1059)
# нажатие на вкладку
pg.click(45, 15)
# нажатие на кнопку КУПИТЬ
pg.click(899, 464)
# нажатие на кнопку ОПЛАТИТЬ
pg.click(915, 608)
pg.click(915, 608)
pg.click(915, 608)

# нажатие на иконку браузера
pg.click(467, 1059)
# нажатие на вкладку
pg.click(45, 15)
# нажатие на кнопку КУПИТЬ
pg.click(899, 464)
# нажатие на кнопку ОПЛАТИТЬ
pg.click(915, 608)
pg.click(915, 608)
pg.click(915, 608)

# нажатие на иконку браузера
pg.click(515, 1059)
# нажатие на вкладку
pg.click(45, 15)
# нажатие на кнопку КУПИТЬ
pg.click(899, 464)
# нажатие на кнопку ОПЛАТИТЬ
pg.click(915, 608)
pg.click(915, 608)
pg.click(915, 608)

# нажатие на иконку браузера\\
pg.click(564, 1059)
# нажатие на окно
pg.click(45, 15)
# нажатие на кнопку КУПИТЬ
pg.click(899, 464)
# нажатие на кнопку ОПЛАТИТЬ
pg.click(915, 608)
pg.click(915, 608)
pg.click(915, 608)

# нажатие на иконку браузера
pg.click(615, 1059)
# нажатие на вкладку
pg.click(45, 15)
# нажатие на кнопку КУПИТЬ
pg.click(899, 464)
# нажатие на кнопку ОПЛАТИТЬ
pg.click(915, 608)
pg.click(915, 608)
pg.click(915, 608)

# нажатие на иконку браузера
pg.click(662, 1059)
# нажатие на вкладку
pg.click(45, 15)
# нажатие на кнопку КУПИТЬ
pg.click(899, 464)
# нажатие на кнопку ОПЛАТИТЬ
pg.click(915, 608)
pg.click(915, 608)
pg.click(915, 608)

# нажатие на иконку браузера
pg.click(712, 1059)
# нажатие на вкладку
pg.click(45, 15)
# нажатие на кнопку КУПИТЬ
pg.click(899, 464)
# нажатие на кнопку ОПЛАТИТЬ
pg.click(915, 608)
pg.click(915, 608)
pg.click(915, 608)

# нажатие на иконку браузера
pg.click(759, 1059)
# нажатие на вкладку
pg.click(45, 15)
# нажатие на кнопку КУПИТЬ
pg.click(899, 464)
# нажатие на кнопку ОПЛАТИТЬ
pg.click(915, 608)
pg.click(915, 608)
pg.click(915, 608)

# нажатие на иконку браузера
pg.click(809, 1059)
# нажатие на вкладку
pg.click(45, 15)
# нажатие на кнопку КУПИТЬ
pg.click(899, 464)
# нажатие на кнопку ОПЛАТИТЬ
pg.click(915, 608)
pg.click(915, 608)
pg.click(915, 608)

# нажатие на иконку браузера
pg.click(858, 1059)
# нажатие на вкладку
pg.click(45, 15)
# нажатие на кнопку КУПИТЬ
pg.click(899, 464)
# нажатие на кнопку ОПЛАТИТЬ
pg.click(915, 608)
pg.click(915, 608)
pg.click(915, 608)

# нажатие на иконку браузера
pg.click(908, 1059)
# нажатие на вкладку
pg.click(45, 15)
# нажатие на кнопку КУПИТЬ
pg.click(899, 464)
# нажатие на кнопку ОПЛАТИТЬ
pg.click(915, 608)
pg.click(915, 608)
pg.click(915, 608)

# нажатие на иконку браузера
pg.click(957, 1059)
# нажатие на вкладку
pg.click(45, 15)
# нажатие на кнопку КУПИТЬ
pg.click(899, 464)
# нажатие на кнопку ОПЛАТИТЬ
pg.click(915, 608)
pg.click(915, 608)
pg.click(915, 608)

# нажатие на иконку браузера
pg.click(1005, 1059)
# нажатие на вкладку
pg.click(45, 15)
# нажатие на кнопку КУПИТЬ
pg.click(899, 464)
# нажатие на кнопку ОПЛАТИТЬ
pg.click(915, 608)
pg.click(915, 608)
pg.click(915, 608)

# нажатие на иконку браузера
pg.click(1055, 1059)
# нажатие на вкладку
pg.click(45, 15)
# нажатие на кнопку КУПИТЬ
pg.click(899, 464)
# нажатие на кнопку ОПЛАТИТЬ
pg.click(915, 608)
pg.click(915, 608)
pg.click(915, 608)
